# Machine Learning Foundation

## Section 1, Part b: Reading Data Lab

In [3]:
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

## Lab Exercise: Reading in database files

 - Create a variable, `path`, containing the path to the `baseball.db` contained in `resources/`
 - Create a connection, `con`, that is connected to database at `path`
 - Create a variable, `query`, containing a SQL query which reads in all data from the `allstarfull` table
 - Create a variable, `observations`, by using pandas' [read_sql](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork837-2023-01-01)

### Optional
 - Create a variable, `tables`, which reads in all data from the table `sqlite_master`
 - Pretend that you were interesting in creating a new baseball hall of fame. Join and analyze the tables to evaluate the top 3 all time best baseball players.

In [4]:
!wget -P data https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-ML0232EN-SkillsNetwork/asset/baseball.db

--2024-01-16 14:52:44--  https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-ML0232EN-SkillsNetwork/asset/baseball.db
Resolving cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)... 169.63.118.104
Connecting to cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)|169.63.118.104|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 7626752 (7.3M) [binary/octet-stream]
Saving to: ‘data/baseball.db.1’

baseball.db.1       100%[===================>]   7.27M  5.17MB/s    in 1.4s

2024-01-16 14:52:47 (5.17 MB/s) - ‘data/baseball.db.1’ saved [7626752/7626752]

In [5]:
path = './data/baseball.db'
con = sq3.Connection(path)
con

In [8]:
query = '''
SELECT * FROM allstarfull
'''

In [9]:
observations = pd.read_sql(query, con)
observations.head()

   index   playerID  yearID  gameNum  ... teamID lgID   GP  startingPos
0      0  gomezle01    1933        0  ...    NYA   AL  1.0          1.0
1      1  ferreri01    1933        0  ...    BOS   AL  1.0          2.0
2      2  gehrilo01    1933        0  ...    NYA   AL  1.0          3.0
3      3  gehrich01    1933        0  ...    DET   AL  1.0          4.0
4      4  dykesji01    1933        0  ...    CHA   AL  1.0          5.0

[5 rows x 9 columns]

In [10]:
tables = pd.read_sql('SELECT * FROM sqlite_master', con)
tables.head()

    type  ...                                                sql
0  table  ...  CREATE TABLE "allstarfull" (\n"index" INTEGER,...
1  index  ...  CREATE INDEX "ix_allstarfull_index"ON "allstar...
2  table  ...  CREATE TABLE "schools" (\n"index" INTEGER,\n  ...
3  index  ...  CREATE INDEX "ix_schools_index"ON "schools" ("...
4  table  ...  CREATE TABLE "batting" (\n"index" INTEGER,\n  ...

[5 rows x 5 columns]

In [35]:
hall_of_fame_query = '''
SELECT playerID, teamID, AVG(startingPos) AS avg_starting_pos, SUM(GP) as total_games_played
FROM allstarfull
GROUP BY playerId
ORDER BY avg_starting_pos DESC, total_games_played DESC
LIMIT 3
'''

In [36]:
hall_of_fame_res = pd.read_sql(hall_of_fame_query, con)
hall_of_fame_res.head()

    playerID teamID  avg_starting_pos  total_games_played
0  martied01    SEA              10.0                 7.0
1  baineha01    CHA              10.0                 6.0
2  guerrpe01    LAN              10.0                 4.0